<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class AboutSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        DB::table('abouts')->insert([
            [
                'titleAr' => 'عن سما',
                'titleEn' => 'عن سما',
                'descriptionAr' => '<p><b>منذ 1990</b></p><p>كوننا مجموعة إنشاءات تأسست في عام 1990، فقد شهدنا نموًا ملحوظًا على مر السنين، وقمنا بتوسيع نطاق أعمالنا وتنويعها في مجموعة متنوعة من القطاعات. ومن خلال مبادرات النمو الاستراتيجي، تقدم مجموعتنا خدمات في القطاعات المدنية والعمرانية والصناعية والتجارية والعسكرية والطبية. لدينا تفاني في تحقيق التميز والاستباقية وذلك يتجسد بوضوح في مسيرتنا التطورية.</p>',
                'descriptionEn' => '<p><b>منذ 1990</b></p><p>كوننا مجموعة إنشاءات تأسست في عام 1990، فقد شهدنا نموًا ملحوظًا على مر السنين، وقمنا بتوسيع نطاق أعمالنا وتنويعها في مجموعة متنوعة من القطاعات. ومن خلال مبادرات النمو الاستراتيجي، تقدم مجموعتنا خدمات في القطاعات المدنية والعمرانية والصناعية والتجارية والعسكرية والطبية. لدينا تفاني في تحقيق التميز والاستباقية وذلك يتجسد بوضوح في مسيرتنا التطورية.</p>',
                'contentAr' => 'نبني الثقة',
                'contentEn' => 'نبني الثقة',
                'image' => 'image1.jpg',
                'images' => 'image1.jpg,image2.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
            [
                'titleAr' => 'كلمة الرئيس',
                'titleEn' => 'كلمة الرئيس',
                'descriptionAr' => '<p><b>كلمة الرئيس</b></p><p>بفضــل وتوفيــق مــن المولــى عــز وجــل خطــت ســما خطــوات متميــزة
                                                                طــوال تاريخهــا الممتــد نحــو تحقيــق تجربــة فريــدة ومتميــزة فــي
                                                                المجــاالت العســكرية والمدنيــة والمجــاالت األخــرى. نحــن ملتزمــون
                                                                بقيــم أساســية تشــكل جوهــر عملنــا، االمتيــاز، النزاهــة، االبتــكار،
                                                                السالمـة، والجـودة وسـرعة اإلنتـاج. نعمـل بجـد لتوفيـر حلـول مخصصـة
                                                                ومتكاملــة تلبــي احتياجــات كل عميــل، مســتفيدون مــن خبرتنــا الغنيــة
                                                                إلنجـاز هـذا الهـدف. نضـع االسـتدامة والتحسـين المسـتمر فـي صـدارة
                                                                أولوياتنـا، مـع التركيـز علـى تعزيـز أدائنـا وتقليـل التأثيـر السـلبي علـى
                                                                ً
                                                                البيئـة. كذلـك نحـن ملتزمـون بتطويـر فريقنـا وتمكينهـم ليكونـوا عنصـرًا
                                                                ً فـي رحلتنـا نحـو النجـاح. كفريـق متحـد ومتناغـم، نطمـح
                                                                ً ومؤثـرًا
                                                                فـاعًال
                                                                إلـى تعزيـز مكانتنـا كشـركة رائـدة فـي كافـة مجـاالت عملنـا، مـع الحـرص
                                                                علـى تحقيـق أعلـى معاييـر الجـودة والكفـاءة فـي جميـع مشـروعاتنا
                                                                وخدماتــنا.<br><br><b>رئيس مجلس الادارة<br></b>سلطان بن سلمان سليم الصاعدي<br></p><br>',
                'descriptionAr' => '<p><b>كلمة الرئيس</b></p><p>بفضــل وتوفيــق مــن المولــى عــز وجــل خطــت ســما خطــوات متميــزة
                                                                طــوال تاريخهــا الممتــد نحــو تحقيــق تجربــة فريــدة ومتميــزة فــي
                                                                المجــاالت العســكرية والمدنيــة والمجــاالت األخــرى. نحــن ملتزمــون
                                                                بقيــم أساســية تشــكل جوهــر عملنــا، االمتيــاز، النزاهــة، االبتــكار،
                                                                السالمـة، والجـودة وسـرعة اإلنتـاج. نعمـل بجـد لتوفيـر حلـول مخصصـة
                                                                ومتكاملــة تلبــي احتياجــات كل عميــل، مســتفيدون مــن خبرتنــا الغنيــة
                                                                إلنجـاز هـذا الهـدف. نضـع االسـتدامة والتحسـين المسـتمر فـي صـدارة
                                                                أولوياتنـا، مـع التركيـز علـى تعزيـز أدائنـا وتقليـل التأثيـر السـلبي علـى
                                                                ً
                                                                البيئـة. كذلـك نحـن ملتزمـون بتطويـر فريقنـا وتمكينهـم ليكونـوا عنصـرًا
                                                                ً فـي رحلتنـا نحـو النجـاح. كفريـق متحـد ومتناغـم، نطمـح
                                                                ً ومؤثـرًا
                                                                فـاعًال
                                                                إلـى تعزيـز مكانتنـا كشـركة رائـدة فـي كافـة مجـاالت عملنـا، مـع الحـرص
                                                                علـى تحقيـق أعلـى معاييـر الجـودة والكفـاءة فـي جميـع مشـروعاتنا
                                                                وخدماتــنا.</p>',         
                'contentAr' => 'نبني الثقة',
                'contentEn' => 'نبني الثقة',
                'image' => 'image1.jpg',
                'images' => 'image1.jpg,image2.jpg',
                'created_at' => now(),
                'updated_at' => now(),
            ],
        ]);
    }
}
